Revit 2026 API

# CurveArrArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArrArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
CurveArrArrayIterator()
```
```fsharp
new : unit -> CurveArrArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CurveArrArrayIterator Class

Autodesk.Revit.DB Namespace